// Артем Удовиченко, [13.11.2024 12:11]
// Каждую задачу нужно решить тремя циклами(for, while, do while)
// Легкий уровень
// 0.Вывести три раза в консоль слово хуй
// 1.Вывести числа от 1 до 10. Каждое число в новой строке в консоли.
// 2.Вывести числа от 10 до 1. Каждое число в новой строке в консоли.
// 3.Вывести число 3 6 9 12... до 100
// 4.Вывести только четные число от 2 до 40
// 5.Вывести числа от 1 до 10. Все число должны быть в одной строке(конкатенация).
// 6.Посчитать сумму всех чисел от 1  до 10
// 7.Посчитать факториал введенного числа
// 8.Найти сумму всех четных чисел от 10 до 20
// 9.Вывести таблицу умножения на 5 (от 1 до 10)
// 10.Спросить у пользователя ты долбоеб? Он должен ответить да или нет. Спрашивать у него до тех пор пока он не согласится.

//?------------------------------0-------------------------------------------------------
//? Каждую задачу нужно решить тремя циклами(for, while, do while)

// 0.Вывести три раза в консоль слово бе-бе-бе'

// for (let i = 0; i < 3; i++) {
//   console.log('бе-бе-бе');
// }

// let num = 0;
// let word = 'бе-бе-бе';
// while (num < 3) {
//   console.log(word);
//   num++;
// }

// let num = 0;
// let word = 'бе-бе-бе';
// do {
//   console.log('бе-бе-бе');
//   num++
// } while (num < 3);

//?--------------------------1---------------------------------------------------
//? Каждую задачу нужно решить тремя циклами(for, while, do while)
// 1.Вывести числа от 1 до 10. Каждое число в новой строке в консоли.

// for (let i = 1; i < 11; i++) {
//   console.log(i);
// }

// let i = 1;
// while (i < 11) {
//   console.log(i);
//   i++;
// }

// let i = 1;
// do {
//   console.log(i);
//   i++;
// } while (i < 11);

//?----------------------------2-----------------------------------------------
//? Каждую задачу нужно решить тремя циклами(for, while, do while)
// 2.Вывести числа от 10 до 1. Каждое число в новой строке в консоли.

// for (let i = 10; i > 0; i--) {
//   console.log(i);
// }

// let i = 10;
// while (i > 0) {
//   console.log(i);
//   i--;
// }

// let i = 10;
// do {
//   console.log(i);
//   i--;
// } while (i > 0);

//?--------------------------------------3-----------------------------
//? Каждую задачу нужно решить тремя циклами(for, while, do while)
// 3.Вывести число 3 6 9 12... до 100

// for (let i = 3; i < 100; i += 3){

//   console.log(i);

// }

// let i = 3;
// while (i < 100) {
//   console.log(i);
//   i += 3;
// }

// let i = 3;
// do {
//   console.log(i);

//   i += 3;
// } while (i < 100);
//?-----------------------------------4----------------------------------------
//? Каждую задачу нужно решить тремя циклами(for, while, do while)\
// 4.Вывести только четные число от 2 до 40

// for (let i = 2; i < 42; i += 2) {
//   console.log(i);
// }

// let i = 2;
// while (i < 42) {
//   console.log(i);
//   i += 2;
// }

// let i = 2;

// do {
//   console.log(i);
//   i += 2;
// } while (i < 42);
